memaid codes added inside the .md files
